app/helpers/sessions_helper.rb

  def sign_in(user)
    remember_token = User.new_remember_token
    cookies.permanent[:remember_token] = remember_token
    user.update_attribute(:remember_token, User.digest(remember_token))
---
UPDATE "users" SET "updated_at" = ?, "remember_token" = ? WHERE "users"."id" = ?  [["updated_at", "2021-03-10 09:15:46.366624"], ["remember_token", "c0bb0c5be930ccbacf5ff0d7e8be2a8d6a0d239b"], ["id", 1]]

  def current_user
    remember_token = User.digest(cookies[:remember_token])
    @current_user ||= User.find_by(remember_token: remember_token)
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "d0e4d5ec80f1d51d955bef729eccee87026a1d5e"], ["LIMIT", 1]]

  def sign_out
    current_user.update_attribute(:remember_token,
                                  User.digest(User.new_remember_token))
---
UPDATE "users" SET "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_token", "28ac233f3d660d0fe49180c0fb634aae80250e57"], ["updated_at", "2021-03-11 17:09:42.757177"], ["id", 1]]