app/controllers/events_controller.rb

    def create
        @event = current_user.events.build(event_params)
        if @event.save
---
INSERT INTO "events" ("title", "location", "date", "creator_id", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?, ?, ?)

    def index
        # @events = Event.paginate(page: params[:page]).per_page(10)
        @events_upcoming = Event.upcoming.paginate(page: params[:upcoming])
---
SELECT "events".* FROM "events" WHERE (Date >= '2021-03-01') ORDER BY Date ASC LIMIT ? OFFSET ?  [["LIMIT", 11], ["OFFSET", 0]]