app/controllers/invites_controller.rb

    def create
        @event = Event.find(params[:invite][:attended_event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @event = Invite.find(params[:id]).attended_event
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]