app/models/user.rb

  def attending?(event)
    event.invitees.include?(self)
---
SELECT "invites".* FROM "invites" WHERE "invites"."invitee_id" = ? AND "invites"."event_id" = ? LIMIT ?  [["invitee_id", 1], ["event_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "invites" ON "users"."id" = "invites"."invitee_id" WHERE "invites"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 3], ["id", 2], ["LIMIT", 1]]

  def attend!(event)
    invites.create!(event_id: event.id)
---
INSERT INTO "invites" ("invitee_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["invitee_id", 1], ["event_id", 3], ["created_at", "2021-03-16 20:12:52.871835"], ["updated_at", "2021-03-16 20:12:52.871835"]]

  def cancel!(event)
    invites.find_by(event_id: event.id).destroy
---
DELETE FROM "invites" WHERE "invites"."id" = ?  [["id", 1]]